package postTests;

import baseTest.BaseTest;

/*ДЗ#7
написати тест на створення поста (створивши новий класс) у якому :
- залогінитися юзером newqaauto ,
пароль для якого витягнути з таблиці seleniumUsers
(створивши клас для цієї таблиці(в назву класу додайте назву таблиці),
аналогічний DB_Util , і відповідний метод для отримання паролю)
- данні для Title, body, чекбокса і дропдауна витягнути з testData.xls,
створивши в ньому відповідний аркуш і додавши тестові данні (title повинен бути кожного разу унікальним)
*/
public class CreatePostWithDB extends BaseTest {

}
